Documents/ТранспортныеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ТранспортныеРасходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаДоставкуПоПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПриходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТарифыНаДоставкуПоМаршруту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТарифыНаДоставкуПоМаршруту</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаКг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВесОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыРасчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДСсверху</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСвТомЧисле</Name>
					<Comment>Входит с стоимость</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13</Name>
					<Comment>(Общ) Ставка НДС 13%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13_113</Name>
					<Comment>(Общ) Расчетная ставка НДС 13% / 113%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПриходСкладскойУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходСкладскойУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзТорговойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОборудованияОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОборудованияСТорговойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеУпаковкиОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТранспортныеРасходы/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура РассчитатьСуммуНДС()
	
	Перем мСуммаВключаетНДС;
	
	мСуммаВключаетНДС = (Объект.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДСвТомЧисле);
	Если Объект.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.БезНДС Тогда
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Объект.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Объект.Сумма,
													   Истина, мСуммаВключаетНДС,
													   УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
	
КонецПроцедуры

Процедура ЗаполнитьСуммыДокументаПоПриходникам()
	
	Если Объект.ПриходныеОрдера.Количество() = 0 Тогда
		Объект.ВариантРасчетаНДС 	= Перечисления.ВариантыРасчетаНДС.ПустаяСсылка();
		Объект.Сумма 				= 0;
		Объект.СуммаНДС 			= 0;
		Возврат;
	КонецЕсли;
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Маршрут"				, Объект.Маршрут);
	Запрос.УстановитьПараметр("ДатаНачала"			, Объект.Дата);
	Запрос.УстановитьПараметр("МассивПриходников"	, Объект.ПриходныеОрдера.Выгрузить().ВыгрузитьКолонку("ПриходныйОрдер"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыНаДоставкуПоМаршруту.ВесОт КАК ВесОт,
	|	ТарифыНаДоставкуПоМаршруту.Сумма КАК Сумма,
	|	ТарифыНаДоставкуПоМаршруту.ВариантРасчетаНДС,
	|	ТарифыНаДоставкуПоМаршруту.СтавкаНДС,
	|	ТарифыНаДоставкуПоМаршруту.СуммаНДС,
	|	ТарифыНаДоставкуПоМаршруту.ЦенаЗаКг,
	|	ТарифыНаДоставкуПоМаршруту.Перевозчик
	|ИЗ
	|	РегистрСведений.ТарифыНаДоставкуПоМаршруту.СрезПоследних(ДОБАВИТЬКДАТЕ(&ДатаНачала, СЕКУНДА, 1), Маршрут = &Маршрут) КАК ТарифыНаДоставкуПоМаршруту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф КАК ЕдиныйТариф
	|		ИЗ
	|			РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(ТарифыНаДоставкуПоМаршруту.Период) КАК Период
	|				ИЗ
	|					РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	|				ГДЕ
	|					ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут
	|					И НЕ ТарифыНаДоставкуПоМаршруту.Период > &ДатаНачала) КАК ВТПоследняяЗапись
	|				ПО (ВТПоследняяЗапись.Период = ТарифыНаДоставкуПоМаршруту.Период)
	|		ГДЕ
	|			ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут
	|			И НЕ ТарифыНаДоставкуПоМаршруту.Период > &ДатаНачала
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф) КАК ВТПоследниеПериоды
	|		ПО (ВТПоследниеПериоды.ЕдиныйТариф = ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТарифыНаДоставкуПоМаршруту.ВесОт УБЫВ";
	
	ТаблицаТарифов = Запрос.Выполнить().Выгрузить();
	
	мОбщийВес = 0;
	Для Каждого СтрокаТЧ Из Объект.ПриходныеОрдера Цикл
		ТекТЧТовары = СтрокаТЧ.ПриходныйОрдер.Товары;
		Для Каждого СтрокаТовары Из ТекТЧТовары Цикл
			мОбщийВес = мОбщийВес + СтрокаТовары.ЕдиницаИзмерения.Вес * СтрокаТовары.Количество;
		КонецЦикла;
	КонецЦикла;
	
	//
	Для Каждого СтрокаТарифа Из ТаблицаТарифов Цикл
		Если НЕ мОбщийВес < СтрокаТарифа.ВесОт Тогда
			Объект.Сумма 				= СтрокаТарифа.Сумма 	* ?(СтрокаТарифа.ЦенаЗаКг, мОбщийВес, 1);
			Объект.СуммаНДС 			= СтрокаТарифа.СуммаНДС * ?(СтрокаТарифа.ЦенаЗаКг, мОбщийВес, 1);
			Объект.ВариантРасчетаНДС 	= СтрокаТарифа.ВариантРасчетаНДС;
			Объект.СтавкаНДС 			= СтрокаТарифа.СтавкаНДС;
			Объект.Перевозчик 			= СтрокаТарифа.Перевозчик;
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПриходныеОрдера()
	
	// очистка табличной части приходников (кроме введенных вручную)
	МассивКУдалению = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.ПриходныеОрдера Цикл
		Если СтрокаТЧ.ДобавленВручную Тогда
			Продолжить;
		КонецЕсли;
		МассивКУдалению.Добавить(СтрокаТЧ);
	КонецЦикла;
	Для Каждого СтрокаТЧ Из МассивКУдалению Цикл
		Объект.ПриходныеОрдера.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"			, НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаПредыдущая1"		, НачалоДня(Объект.Дата) - 7 * 86400);
	Запрос.УстановитьПараметр("ДатаПредыдущая2"		, НачалоДня(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Перевозчик"			, Объект.Перевозчик);
	Запрос.УстановитьПараметр("МассивПоставщиков"	, Объект.Поставщики.Выгрузить().ВыгрузитьКолонку("Поставщик"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходныйОрдерСклад.Ссылка КАК ПриходныйОрдер
	|ИЗ
	|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
	|ГДЕ
	|	ПриходныйОрдерСклад.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходСкладскойУчет.ОтПоставщика)
	|	И ПриходныйОрдерСклад.Проведен
	|	И НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА НЕ ПриходныйОрдерСклад.ДатаДокументаПоставщика = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ПриходныйОрдерСклад.ДатаДокументаПоставщика
	|				ИНАЧЕ ПриходныйОрдерСклад.Дата
	|			КОНЕЦ, ДЕНЬ) = &ДатаНачала
	|	И ПриходныйОрдерСклад.Поставщик В(&МассивПоставщиков)
	|	И ПриходныйОрдерСклад.Автомобиль.Перевозчик = &Перевозчик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерСклад.Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныеРасходы.ПриходныеОрдера КАК ТранспортныеРасходыПриходныеОрдера
	|		ПО (ТранспортныеРасходыПриходныеОрдера.Ссылка.Дата >= &ДатаПредыдущая1)
	|			И (ТранспортныеРасходыПриходныеОрдера.ПриходныйОрдер = ПриходныйОрдерСклад.Ссылка)
	|ГДЕ
	|	ПриходныйОрдерСклад.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходСкладскойУчет.ОтПоставщика)
	|	И ПриходныйОрдерСклад.Проведен
	|	И ВЫБОР
	|			КОГДА НЕ ПриходныйОрдерСклад.ДатаДокументаПоставщика = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ПриходныйОрдерСклад.ДатаДокументаПоставщика
	|			ИНАЧЕ ПриходныйОрдерСклад.Дата
	|		КОНЕЦ МЕЖДУ &ДатаПредыдущая1 И &ДатаПредыдущая2
	|	И ПриходныйОрдерСклад.Поставщик В(&МассивПоставщиков)
	|	И ПриходныйОрдерСклад.Автомобиль.Перевозчик = &Перевозчик
	|	И ТранспортныеРасходыПриходныеОрдера.ПриходныйОрдер ЕСТЬ NULL ";
	
	ТекТЧТовары = Объект.Маршрут.Товары;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекПриходник = Выборка.ПриходныйОрдер;
		
		ТекТоварыПриходника = ТекПриходник.Товары;
		мДобавлять = (ТекТоварыПриходника.Количество() > 0);
		Если мДобавлять
				И ТекТЧТовары.Количество() > 0 Тогда
			мДобавлять = Ложь;
			Для Каждого СтрокаТЧ Из ТекТоварыПриходника Цикл
				Если НЕ ТекТЧТовары.Найти(СтрокаТЧ.Номенклатура, "Номенклатура") = Неопределено Тогда
					мДобавлять = Истина;
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если НЕ мДобавлять Тогда
			Продолжить;
		КонецЕсли;
		
		//
		НоваяСтрока = Объект.ПриходныеОрдера.Добавить();
		НоваяСтрока.ПриходныйОрдер = ТекПриходник;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоМаршрутуСервер()
	
	Перем мТаблица;
	
	Объект.Организация 	= Объект.Маршрут.Организация;
	//Объект.Перевозчик 	= Объект.Маршрут.Перевозчик;
	
	мТаблица = Объект.Маршрут.Поставщики.Выгрузить();
	
	// поставщики
	Объект.Поставщики.Загрузить(мТаблица);
	
	//
	ЗаполнитьПриходныеОрдера();
	ЗаполнитьСуммыДокументаПоПриходникам();
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут);
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних.Сумма,
	//|	РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних.ВариантРасчетаНДС,
	//|	РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних.СтавкаНДС,
	//|	РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних.СуммаНДС
	//|ИЗ
	//|	РегистрСведений.ТарифыНаДоставкуПоМаршруту.СрезПоследних(, Маршрут = &Маршрут) КАК РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф КАК ЕдиныйТариф
	//|		ИЗ
	//|			РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|					МАКСИМУМ(ТарифыНаДоставкуПоМаршруту.Период) КАК Период
	//|				ИЗ
	//|					РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	//|				ГДЕ
	//|					ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут) КАК ВТПоследняяЗапись
	//|				ПО (ВТПоследняяЗапись.Период = ТарифыНаДоставкуПоМаршруту.Период)
	//|		ГДЕ
	//|			ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф) КАК ПоследниеПериоды
	//|		ПО (ПоследниеПериоды.ЕдиныйТариф = РегистрСведенийТарифыНаДоставкуПоМаршрутуСрезПоследних.ЕдиныйТариф)";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ЗаполнитьЗначенияСвойств(Объект, Выборка);
	//Иначе
	//	Объект.ВариантРасчетаНДС 	= 0;
	//	Объект.Сумма 				= 0;
	//	Объект.СуммаНДС 			= 0;
	//КонецЕсли;
	
	//Объект.ВариантРасчетаНДС 	= Объект.Маршрут.ВариантРасчетаНДС;
	//Объект.Сумма 				= Объект.Маршрут.Сумма;
	//Объект.СуммаНДС 			= Объект.Маршрут.СуммаНДС;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// значения "по умолчанию"
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Автор 		= ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата 		= ТекущаяДата();
		Объект.Организация 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		
		Объект.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДСвТомЧисле;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(Объект.Ссылка.ПолучитьОбъект(), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	ЗаполнитьПоМаршрутуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	РассчитатьСуммуНДС();
	//ДопМодульКлиентСервер.ПересчитатьСуммуНДС(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриходныеОрдераПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если (НЕ ТекДанные.ПриходныйОрдер.Пустая())
			И НЕ ТекДанные.ПриходныйОрдер.Автомобиль.Перевозчик = Объект.Перевозчик Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Перевозчик у автомобиля перевозчика в приходном ордере не соответствует перевозчику документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекДанные.ДобавленВручную = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриходныеОрдераПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьСуммыДокументаПоПриходникам();

КонецПроцедуры
